# 第四周:数据分析之概要

## 本周课程概要

## Pandas库入门

### Pandas库的介绍

http:/pandas.pydata.org

Pandas 库的引用

- Pandas 是 Python 第三方库,提供高性能易用数据类型和分析工具

```python
import pandas as pd
```

- Pandas 基于 NumPy 实现,常与 NumPy 和 Matplotlib 一同使用

In [1]:
import pandas as pd
d = pd.Series(range(1, 11))
d

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [2]:
d.cumsum()#计算前N项累加和

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
9    55
dtype: int64

两个数据类型:Series,DataFrame

- 基于上述数据类型的各类操作
- 基本操作,运算操作,特征类操作,关联类操作

### Pandas库的Series类型

#### Series类型

Series 类型由一组数据及与之相关的数据索引组成:

| 索引    | 数据   |
| ------- | ------ |
| index_0 | data_a |
| index_1 | data_b |
| index_2 | data_c |
| index_3 | data_d |

In [3]:
import pandas as pd

d = pd.Series(range(1, 11))
d

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
import pandas as pd

b = pd.Series([9, 8, 7, 6], index=['a', 'b', 'c', 'd'])
b

a    9
b    8
c    7
d    6
dtype: int64

Series 类型可以由如下类型创建

- Python 列表
- 标量值
- Python 字典
- ndarray
- 其他函数

从标量值创建

In [8]:
import pandas as pd

s = pd.Series(25, index=["a", "b", "c"])

s

a    25
b    25
c    25
dtype: int64

从字典类型创建

In [9]:
import pandas as pd

d = pd.Series({"a": 9, "b": 8, "c": 7, "d": 6})
d

a    9
b    8
c    7
d    6
dtype: int64

In [10]:
import pandas as pd
# 以前面的为主,没出现的为NaN
d = pd.Series({"a": 9, "b": 8, "c": 7}, index=["b", "c", "d", "a"])
d

b    8.0
c    7.0
d    NaN
a    9.0
dtype: float64

从ndarray类型创建

In [12]:
import pandas as pd
import numpy as np

n = pd.Series(np.arange(10))
n

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [13]:
a = pd.Series(np.arange(10), index=np.arange(9, -1, -1))
a

9    0
8    1
7    2
6    3
5    4
4    5
3    6
2    7
1    8
0    9
dtype: int32

Series 类型可以由如下类型创建

- Python 列表,index 与列表元素个数一致.
- 标量值,index 表达 Series 类型的尺寸
- Python 字典,键值对中的"键"是索引,index 从字典中进行选择操作.
- ndarray,索引和数据都可以通过 ndarray 类型创建
- 其他函数,range()函数等

#### Series类基本操作

Series 类基本操作

- Series 类型包括 indexi 和 values 两部分.
- Series 类型的操作类以 ndarray 类型.
- Series 类型的操作类似 Python 字典类型

In [15]:
import pandas as pd

b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
b

a    9
b    8
c    7
d    6
dtype: int64

In [16]:
b.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
b.values

array([9, 8, 7, 6], dtype=int64)

In [18]:
b['b']

8

In [19]:
b[1]

8

In [23]:
# b[['c', 'd', 'a']]
b[['c', 'd', 'a']]

c    7
d    6
a    9
dtype: int64

Series 类型的操作类似 ndarray 类型

- 索引方法相同,采用 Ⅱ.
- NumPy 中运算和操作可用于 Series 类型.
- 可以通过自定义索引的列表进行切片.
- 可以通过自动索引进行切片,如果存在自定义索引,则一同被切片

In [25]:
b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
b[3]

6

In [26]:
b[:3]

a    9
b    8
c    7
dtype: int64

In [27]:
b[b>b.median()]

a    9
b    8
dtype: int64

In [28]:
np.exp(b)

a    8103.083928
b    2980.957987
c    1096.633158
d     403.428793
dtype: float64

Series 类型的操作类似 Python 字典类型

- 通过自定义索引访问
- 保留字 in 操作
- 使用.geto 方法

In [29]:
import pandas as pd

b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
'b' in b

True

In [30]:
'c' in b

True

In [31]:
0 in b

False

In [32]:
b.get('f', 100)

100

In [33]:
# Series+Series
# Series类型在运算中会自动对齐不同索引的数据
import pandas as pd

a = pd.Series([1, 2, 3], index=["c", "d", "e"])
b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
a + b

a    NaN
b    NaN
c    8.0
d    8.0
e    NaN
dtype: float64

Serie对象和索引都可以有一个名字,存储在属性.name中

In [35]:
import pandas as pd

b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
b.name = "Series对象"
b.index.name = "索引列"
b

索引列
a    9
b    8
c    7
d    6
Name: Series对象, dtype: int64

Series对象可以随时修改并即刻生效

In [40]:
b = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
b["a"] = 5
b.name = "Series"
b

a    5
b    8
c    7
d    6
Name: Series, dtype: int64

In [42]:

b.name = "New Series"
b['b'] = 20
b['c'] = 20
b

a     5
b    20
c    20
d     6
Name: New Series, dtype: int64

Series 类型

- Series 是一维带"标签"数组.
- index_0→data_a
- Series 基本操作类似 ndarray 和字典,根据索引对齐.

### DataFrame 类型

DataFrame 类型由公用相同索引的一组数据列组成
| 索引 | 数据 1 | 数据 2 | 数据 3 |
|---------|--------|--------|--------|
| index_0 | data_a | data_1 | data_w |
| index_1 | data_b | data_2 | data_x |
| index_2 | data_c | data_3 | data_y |
| index_3 | data_d | data_4 | data_z |

In [43]:
import pandas as pd
import numpy as np

# 最上面一行是自助列索引
# 最左边一列是自助行索引
d = pd.DataFrame(np.arange(10).reshape(2, 5))
d

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [45]:
import pandas as pd

dt = {"one": pd.Series([1, 2, 3], index=["a", "b", "c"]),
        "two": pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])}

d = pd.DataFrame(dt)
d

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [46]:
pd.DataFrame(dt, index=["b", "c", "d"], columns=["two", "three"])

   two three
b    8   NaN
c    7   NaN
d    6   NaN

In [47]:
import pandas as pd

dl = {"one": [1, 2, 3, 4], "two": [9, 8, 7, 6]}
d = pd.DataFrame(dl, index=["a", "b", "c", "d"])
d

   one  two
a    1    9
b    2    8
c    3    7
d    4    6

| 城市 | 环比  | 同比  | 定基  |
| ---- | ----- | ----- | ----- |
| 北京 | 101.5 | 120.7 | 121.4 |
| 上海 | 101.2 | 127.3 | 127.8 |
| 广东 | 101.3 | 119.4 | 120.0 |
| 深圳 | 102.0 | 140.9 | 145.5 |
| 沈阳 | 100.1 | 101.4 | 101.6 |

In [58]:
import pandas as pd

dl = {
    "城市": ["北京", "上海", "广州", "深圳", "沈阳"],
    "环比": [101.5, 101.2, 101.3, 102.0, 100.1],
    "同比": [120.7, 127.3, 119.4, 140.9, 101.4],
    "定基": [121.4, 127.8, 120.0, 145.5, 101.6],
}

d = pd.DataFrame(dl, index="c1 c2 c3 c4 c5".split())
print(d)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [59]:
d.index

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [60]:
d.columns

Index(['城市', '环比', '同比', '定基'], dtype='object')

In [62]:
d.values

array([['北京', 101.5, 120.7, 121.4],
       ['上海', 101.2, 127.3, 127.8],
       ['广州', 101.3, 119.4, 120.0],
       ['深圳', 102.0, 140.9, 145.5],
       ['沈阳', 100.1, 101.4, 101.6]], dtype=object)

In [63]:
d["同比"]

c1    120.7
c2    127.3
c3    119.4
c4    140.9
c5    101.4
Name: 同比, dtype: float64

In [67]:
d.loc["c2"]

城市       上海
环比    101.2
同比    127.3
定基    127.8
Name: c2, dtype: object

In [68]:
d["同比"]["c2"]

127.3

DataFrame是二维带"标签"数组

重新索引
- .reindex()能够改变或重排Series和DataFrame索引

In [1]:
import pandas as pd

dl = {
    "城市": ["北京", "上海", "广州", "深圳", "沈阳"],
    "环比": [101.5, 101.2, 101.3, 102.0, 100.1],
    "同比": [120.7, 127.3, 119.4, 140.9, 101.4],
    "定基": [121.4, 127.8, 120.0, 145.5, 101.6],
}

d = pd.DataFrame(dl, index="c1 c2 c3 c4 c5".split())
print(d)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [3]:
d = d.reindex(index={'c5', 'c4', 'c3', 'c2', 'c1'})
d

    城市     环比     同比     定基
c5  沈阳  100.1  101.4  101.6
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8

In [4]:
d = d.reindex(columns=["城市", "同比", "定基", "环比"])
d

    城市     同比     定基     环比
c5  沈阳  101.4  101.6  100.1
c3  广州  119.4  120.0  101.3
c4  深圳  140.9  145.5  102.0
c1  北京  120.7  121.4  101.5
c2  上海  127.3  127.8  101.2

重新索引

- .reindex(index=None,columns=None,...)的参数

| 参数           | 说明                                           |
| -------------- | ---------------------------------------------- |
| index, columns | 新的行列自定义索引                             |
| fill_value     | 重新索引中,用于填充缺失位置的值                |
| method         | 填充方法,`ffill`当前值向前填充,`bfill`向后填充 |
| limit          | 最大填充量                                     |
| copy           | 默认 True,生成新的对象,False 时,新旧相等不复制 |

In [2]:
import pandas as pd

dl = {
    "城市": ["北京", "上海", "广州", "深圳", "沈阳"],
    "环比": [101.5, 101.2, 101.3, 102.0, 100.1],
    "同比": [120.7, 127.3, 119.4, 140.9, 101.4],
    "定基": [121.4, 127.8, 120.0, 145.5, 101.6],
}

d = pd.DataFrame(dl, index="c1 c2 c3 c4 c5".split())
print(d)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [3]:
newc = d.columns.insert(4, "新增")
newd = d.reindex(columns=newc, fill_value=200)
newd

    城市     环比     同比     定基   新增
c1  北京  101.5  120.7  121.4  200
c2  上海  101.2  127.3  127.8  200
c3  广州  101.3  119.4  120.0  200
c4  深圳  102.0  140.9  145.5  200
c5  沈阳  100.1  101.4  101.6  200

In [4]:
d.index

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [5]:
d.columns

Index(['城市', '环比', '同比', '定基'], dtype='object')

索引类型

- Series 和 DataFrame 的索引是 Index 类型
- Index 对象是不可修改的类型

- 索引类型的常用方法

| 方法                 | 说明                                      |
| -------------------- | ----------------------------------------- |
| `.append(idx)`       | 连接另一个 Index 对象,产生新的 Index 对象 |
| `.diff(idx)`         | 计算差集,产生新的 Index 对象              |
| `.intersection(idx)` | 计算交集                                  |
| `.union(idx)`        | 计算并集                                  |
| `.delete(loc)`       | 删除 loc 位置处的元素                     |
| `.insert(loc, e)`    | 在 loc 位置增加一个元素 e                 |

In [6]:
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [7]:
nc = d.columns.delete(2)

In [8]:
ni = d.index.insert(5, "c0")

In [11]:
nd = d.reindex(index=ni, columns=nc, fill_value=0)

In [12]:
nd

    城市     环比     定基
c1  北京  101.5  121.4
c2  上海  101.2  127.8
c3  广州  101.3  120.0
c4  深圳  102.0  145.5
c5  沈阳  100.1  101.6
c0   0    0.0    0.0

删除指定索引对象

- .drop()能够删除 Series 和 DataFrame 指定行或列索引

In [13]:
a = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
a

a    9
b    8
c    7
d    6
dtype: int64

In [17]:
a.drop(["b", "c"])

a    9
d    6
dtype: int64

In [18]:
import pandas as pd

dl = {
    "城市": ["北京", "上海", "广州", "深圳", "沈阳"],
    "环比": [101.5, 101.2, 101.3, 102.0, 100.1],
    "同比": [120.7, 127.3, 119.4, 140.9, 101.4],
    "定基": [121.4, 127.8, 120.0, 145.5, 101.6],
}

d = pd.DataFrame(dl, index="c1 c2 c3 c4 c5".split())
print(d)

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [19]:
d.drop("c5")

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [20]:
d.drop("同比", axis=1)

    城市     环比     定基
c1  北京  101.5  121.4
c2  上海  101.2  127.8
c3  广州  101.3  120.0
c4  深圳  102.0  145.5
c5  沈阳  100.1  101.6

算术运算法则

- 算术运算根据行列索引,补齐后运算,运算默认产生浮点数.
- 补齐时缺项填充 NaN(空值)
- 二维和一维,一维和零维间为广播运算
- 采用+ - \*/符号进行的二元运算产生新的对象

In [21]:
import pandas as pd
import numpy as np

a = pd.DataFrame(np.arange(12).reshape(3, 4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [22]:
b = pd.DataFrame(np.arange(20).reshape(4, 5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [23]:
a = b

In [25]:
a * b
# 自动补齐,缺项补齐NaN.

     0    1    2    3    4
0    0    1    4    9   16
1   25   36   49   64   81
2  100  121  144  169  196
3  225  256  289  324  361

数据类型的算术运算

- 方法形式的运算
  | 方法 | 说明 |
  |------------|-------------------|
  | `.add(d, **argws)` | 类型间加法运算,可选参数 |
  | `.sub(d, **argws)` | 类型间减法运算,可选参数 |
  | `.mul(d, **argws)` | 类型间乘法运算,可选参数 |
  | `.div(d, **argws)` | 类型间除法运算,可选参数 |

In [26]:
import pandas as pd
import numpy as np
a = pd.DataFrame(np.arange(12).reshape(3, 4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [28]:
b = pd.DataFrame(np.arange(20).reshape(4, 5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [29]:
b.add(a, fill_value=100)

       0      1      2      3      4
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [30]:
a.mul(b, fill_value=0)

      0     1      2      3    4
0   0.0   1.0    4.0    9.0  0.0
1  20.0  30.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

full_value 参数代替 NaN,替代后参与运算.

In [31]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [32]:
c - 10

0   -10
1    -9
2    -8
3    -7
dtype: int32

In [33]:
b - c

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

数据类型的比较运算

- 不同维度之间为广播运算,一维 Series 默认在轴 1 参与运算
- 同纬度运算,尺寸一致

In [34]:
import pandas as pd
import numpy as np

a = pd.DataFrame(np.arange(12).reshape(3, 4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [35]:
d = pd.DataFrame(np.arange(12,0,-1).reshape(3, 4))
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [36]:
a > d

       0      1      2      3
0  False  False  False  False
1  False  False  False   True
2   True   True   True   True

In [37]:
a == d

       0      1      2      3
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False

不同纬度,广播运算,默认在1轴

In [38]:
import pandas as pd
import numpy as np

a = pd.DataFrame(np.arange(12).reshape(3, 4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [40]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [41]:
a > c

       0      1      2      3
0  False  False  False  False
1   True   True   True   True
2   True   True   True   True

In [42]:
c > 0

0    False
1     True
2     True
3     True
dtype: bool

### 单元小结

Pandas 库入门

- Series = 索引 + 一维数据
- DataFrame = 行列索引 + 二维数据
- 理解数据类型与索引的关系,操作索引即操作数据
- 重新索引,数据删除,算术运算,比较运算
- 像对待单一数据一样对待 Series 和 DataFrame 对象

## Pandas数据特征分析

### 数据的排序

对一组数据的理解

- 一组数据表达一个或多个含义

摘要

- 有损地提取数据特征的过程
- 基本统计(含排序)
- 分布/累计统计
- 数据特征,相关性,周期性等
- 数据挖掘(形成知识)

Pandas 库的数据排序

- .sort_index()方法在指定轴上根据索引进行排序,默认升序.
- .sort_index(axis=0, ascending=True)

In [43]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5),index = ['c','a','d','b'])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [44]:
b.sort_index()

    0   1   2   3   4
a   5   6   7   8   9
b  15  16  17  18  19
c   0   1   2   3   4
d  10  11  12  13  14

In [46]:
b.sort_index(axis=1)

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

.sort_index(axis=0, ascending=True)

In [47]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [48]:
c = b.sort_index(axis=1, ascending=False)
c

    4   3   2   1   0
c   4   3   2   1   0
a   9   8   7   6   5
d  14  13  12  11  10
b  19  18  17  16  15

In [50]:
c = c.sort_index()
c

    4   3   2   1   0
a   9   8   7   6   5
b  19  18  17  16  15
c   4   3   2   1   0
d  14  13  12  11  10

.sort_values()方法在指定轴上根据数值进行排序,默认升序.

- Series.sort_values(by, axis=0, ascending=True)
- DataFrame.sort_values(by, axis=0, ascending=True)
- by:axis 轴上的某个索引或索引列表

In [51]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [53]:
c = b.sort_values(2, ascending=False)
c

    0   1   2   3   4
b  15  16  17  18  19
d  10  11  12  13  14
a   5   6   7   8   9
c   0   1   2   3   4

In [54]:
c = c.sort_values("a", axis=1, ascending=False)
c

    4   3   2   1   0
b  19  18  17  16  15
d  14  13  12  11  10
a   9   8   7   6   5
c   4   3   2   1   0

NaN 统一放到排序末尾

In [55]:
import pandas as pd
import numpy as np

a = pd.DataFrame(np.arange(12).reshape(3, 4), index=["a", "b", "c"])
a

   0  1   2   3
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [56]:
b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [57]:
c = a + b
c

      0     1     2     3   4
a   5.0   7.0   9.0  11.0 NaN
b  19.0  21.0  23.0  25.0 NaN
c   8.0  10.0  12.0  14.0 NaN
d   NaN   NaN   NaN   NaN NaN

In [58]:
c.sort_values(2, ascending=False)   # 以第2列排序

      0     1     2     3   4
b  19.0  21.0  23.0  25.0 NaN
c   8.0  10.0  12.0  14.0 NaN
a   5.0   7.0   9.0  11.0 NaN
d   NaN   NaN   NaN   NaN NaN

In [59]:
c.sort_values(2, ascending=True)  # 以a列排序

      0     1     2     3   4
a   5.0   7.0   9.0  11.0 NaN
c   8.0  10.0  12.0  14.0 NaN
b  19.0  21.0  23.0  25.0 NaN
d   NaN   NaN   NaN   NaN NaN

### 数据的基本统计分析

基本的统计分析函数
适用于 Series 和 DataFrame 类型
| 方法 | 说明 |
|--------------|-------------------------------------|
| `sum()` | 计算数据的总和,按 0 轴计算,下同 |
| `.count()` | 非 NaN 值的数量 |
| `.mean()` | 计算数据的算术平均值 |
| `.median()` | 计算数据的算术中位数 |
| `.var()` | 计算数据的方差 |
| `.std()` | 计算数据的标准差 |
| `min()` | 计算数据的最小值 |
| `.max()` | 计算数据的最大值 |

适用于 Series 类型
| 方法 | 说明 |
|-----------------|------------------------------------------------|
| `.argmin()` | 计算数据最小值所在位置的索引位置(自动索引) |
| `.argmax()` | 计算数据最大值所在位置的索引位置(自动索引) |
| `.idxmin()` | 计算数据最小值所在位置的索引(自定义索引) |
| `.idxmax()` | 计算数据最大值所在位置的索引(自定义索引) |

有一个方法几乎囊括了所有,适用于 Series 和 DataFrame 类型
| 方法 | 说明 |
|----------------|--------------------------------|
| `.describe()` | 针对 0 轴(各列)的统计汇总 |

In [60]:
import pandas as pd

a = pd.Series([9, 8, 7, 6], index=["a", "b", "c", "d"])
a

a    9
b    8
c    7
d    6
dtype: int64

In [61]:
a.describe()

count    4.000000
mean     7.500000
std      1.290994
min      6.000000
25%      6.750000
50%      7.500000
75%      8.250000
max      9.000000
dtype: float64

In [62]:
type(a.describe())

pandas.core.series.Series

In [63]:
a.describe()["count"]

4.0

In [64]:
a.describe()["max"]

9.0

describe()同时也可以用在二维上面

In [65]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b.describe()  # 默认按列统计

               0          1          2          3          4
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [66]:
type(b.describe())

pandas.core.frame.DataFrame

In [67]:
b.describe().loc["max"]

0    15.0
1    16.0
2    17.0
3    18.0
4    19.0
Name: max, dtype: float64

In [68]:
b.describe()[2]

count     4.000000
mean      9.500000
std       6.454972
min       2.000000
25%       5.750000
50%       9.500000
75%      13.250000
max      17.000000
Name: 2, dtype: float64

### 数据的累计分析

累计统计分析函数

- 适用于 Series 和 DataFrame 类型

| 方法         | 说明                              |
| ------------ | --------------------------------- |
| `.cumsum()`  | 依次给出前 1,2,...,n 个数的和     |
| `.cumprod()` | 依次给出前 1,2,...,n 个数的积     |
| `.cummax()`  | 依次给出前 1,2,...,n 个数的最大值 |
| `.cummin()`  | 依次给出前 1,2,...,n 个数的最小值 |

In [71]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [72]:
b.cumsum()

    0   1   2   3   4
c   0   1   2   3   4
a   5   7   9  11  13
d  15  18  21  24  27
b  30  34  38  42  46

In [74]:
b.cumprod()

   0     1     2     3     4
c  0     1     2     3     4
a  0     6    14    24    36
d  0    66   168   312   504
b  0  1056  2856  5616  9576

In [76]:
b.cummin()

   0  1  2  3  4
c  0  1  2  3  4
a  0  1  2  3  4
d  0  1  2  3  4
b  0  1  2  3  4

In [77]:
b.cummax()

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

适用于 Series 和 DataFrame 类型, 滚动计算(窗口计算)
| 方法 | 说明 |
|---------------------------|--------------------------------------|
| `.rolling(w).sum()` | 依次计算相邻 w 个元素的和 |
| `.rolling(w).mean()` | 依次计算相邻 w 个元素的算术平均值 |
| `.rolling(w).var()` | 依次计算相邻 w 个元素的方差 |
| `.rolling(w).std()` | 依次计算相邻 w 个元素的标准差 |
| `.rolling(w).min()`, `.rolling(w).max()` | 依次计算相邻 w 个元素的最小值和最大值 |

In [78]:
import pandas as pd
import numpy as np

b = pd.DataFrame(np.arange(20).reshape(4, 5), index=["c", "a", "d", "b"])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [79]:
b.rolling(2).sum()

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   5.0   7.0   9.0  11.0  13.0
d  15.0  17.0  19.0  21.0  23.0
b  25.0  27.0  29.0  31.0  33.0

In [80]:
b.rolling(3).mean()

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   NaN   NaN   NaN   NaN   NaN
d   5.0   6.0   7.0   8.0   9.0
b  10.0  11.0  12.0  13.0  14.0

### 数据的相关分析

两个事物,表示为 X 和 Y,如何判断它们之间的存在相关性?

- X 增大,Y 增大,两个变量正相关.
- X 增大,Y 减小,两个变量负相关.
- X 增大,Y 无视,两个变量不相关.

$$c o v ( X , Y ) = \frac { \sum _ { i = 1 } ^ { n } ( X _ { i } - \overline { X } ) ( Y _ { i } - \overline { Y } ) } { n - 1 } $$

- 协方差>0,X 和 Y 正相关.
- 协方差<0,X 和 Y 负相关.
- 协方差=0,X 和 Y 独立无关.

Pearson 相关系数
$$r = \frac { \sum _ { i = 1 } ^ { n } ( x _ { i } - \overline { x } ) ( y _ { i } - \overline { y } ) } { \sqrt { \sum _ { i = 1 } ^ { n } ( x _ { i } - \overline { x } ) ^ { 2 } } \sqrt { \sum _ { i = 1 } ^ { n } ( y _ { i } - \overline { y } ) ^ { 2 } } } $$

r 取值范围[-1,1]

- 0.8-1.0 极强相关
- 0.6-0.8 强相关
- 0.4-0.6 中等程度相关
- 0.2-0.4 弱相关
- 0.0-0.2 极弱相关或无相关

相关分析函数(适用于 Series 和 DataFrame 类型)

| 方法      | 说明                                                  |
| --------- | ----------------------------------------------------- |
| `.cov()`  | 计算协方差矩阵                                        |
| `.corr()` | 计算相关系数矩阵,包括 Pearson,Spearman,Kendall 等系数 |

In [81]:
import pandas as pd

# Correcting the indexes and values for hprice
hprice = pd.Series(
    [3.84, 22.93, 12.75, 22.6, 12.33], index=["2008", "2009", "2010", "2011", "2012"]
)

# Correcting the indexes and values for m2
m2 = pd.Series(
    [8.18, 18.38, 9.13, 7.82, 6.69], index=["2008", "2009", "2010", "2011", "2012"]
)

# Calculating the correlation
correlation = hprice.corr(m2)
print(correlation)

0.5323702649465167

### 单元小结

### 一组数据的摘要

- **排序**

  - `.sort_index()`
  - `.sort_values()`

- **基本统计函数**

  - `.describe()`

- **累计统计函数**

  - `.cum*()`
  - `.rolling().*()`

- **相关性分析**
  - `.corr()`
  - `.cov()`